test_cases/squareDuct/nnfoam_inputs/foam_base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0      0     0)   // 0
    (0.2    0     0)   // 1
    (0.2    1     0)   // 2
    (0      1     0)   // 3
    (0      0     1)   // 4
    (0.2    0     1)   // 5
    (0.2    1     1)   // 6
    (0      1     1)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 50 50) simpleGrading (1 20 20) //block 0
);

edges
(
);

boundary
(
    bottomWall
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    leftWall
    {
        type    wall;
        faces
        (
            (0 3 2 1)
        );
    }
    topSym
    {
        type    symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    rightSym
    {
        type    symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type    cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type    cyclic;
        neighbourPatch  inlet;
        faces
        (
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);
