test_cases/squareDuct/nnfoam_inputs/foam_base/0.orig/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
2500
(
(0.000895771 -4.81491e-15 -4.81491e-15)
(0.00240417 -7.32561e-15 -2.57809e-15)
(0.00387642 -3.58925e-15 -8.81625e-16)
(0.00535671 -1.92096e-15 -4.12997e-16)
(0.00686112 -1.15459e-15 -1.94772e-16)
(0.00839154 -7.3341e-16 -8.75784e-17)
(0.00994075 -5.04962e-16 -4.21056e-17)
(0.0114963 -3.76835e-16 -2.24066e-17)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leftWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
